CSI API ETABS v1
cPluginCallback.Finish Method
 This method must be called when the plugin has finished.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
void Finish(
	int iVal
)
Sub Finish (
	iVal As Integer
)
Dim instance As cPluginCallback
Dim iVal As Integer
instance.Finish(iVal)
void Finish(
	int iVal
)
abstract Finish :
        iVal : int -> unit
Parameters
iVal
Type: System.Int32
 Sets the ErrorFlag property
See Also
Reference
cPluginCallback Interface
ETABSv1 Namespace